{
    "name": "Victoria Sloane",
    "age": 28,
    "height": "5'6\"",
    "school": "University of Southern California",
    "job_industry": "Marketing",
    "job_title": "Marketing Manager",
    "hometown_location": "Santa Barbara, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Honesty",
        "Ambition",
        "Health"
    ],
    "interests": [
        "Yoga",
        "Reading",
        "Cooking",
        "Traveling"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Virgo",
    "mbti_personality_type": "ESFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 35,
        "minimum_height": "5'10\"",
        "maximum_height": "6'4\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Hispanic/Latino",
            "East Asian",
            "Black African Descent",
            "Middle Eastern",
            "South Asian"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Tech",
            "Finance",
            "Law",
            "Healthcare"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Honesty",
            "Ambition",
            "Balancing work and family",
            "Health"
        ],
        "interests": [
            "Sports",
            "Outdoor activities",
            "Cooking",
            "Traveling"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "This 28-year-old woman is a Marketing Manager in the marketing industry and a graduate from the University of Southern California. She stands at a height of 5'6\" and resides in Los Angeles, California, originally from Santa Barbara, California. Fluent in English and Spanish, she values honesty, ambition, and health. Some of her interests include yoga, reading, cooking, and traveling. Identifying herself as a straight, white Caucasian, she uses she/her/hers pronouns and adopts monogamous relationships.  Pursuing a long-term relationship, she does not have kids yet but is open to having some in the future.  Her daily lifestyle features active exercise, occasional drinking, but no smoking, marijuana, or drugs. She is an agnostic politically liberal and possesses an ESFJ MBTI personality type. Other details about her include being a Virgo, owning a dog, and seeking partners who similarly value honesty, ambition, and health.",
    "preferences_summary": "The user is interested in dating a man between the ages of 28 and 35 who is 5'10\" to 6'4\" in height. Her potential partner should not have children currently, but must also want children in the future and be straight. She doesn't mind if he drinks occasionally but smoking, marijuana, and drugs are unacceptable. He should lead an active lifestyle. She is open to dating a man from several ethnic backgrounds consisting of White Caucasian, Hispanic/Latino, East Asian, Black African Descent, Middle Eastern, and South Asian. Politically, she'd like her partner to be liberal or moderate. Preferred job industries include Tech, Finance, Law, and Healthcare. He should at very least be able to speak English. This user prizes honesty, ambition, balancing work, and health as important values for her potential partner. She shares interests such as sports, outdoor activities, cooking, and traveling, and she would like her partner to be educated to at least undergraduate level. Her dating intentions are long-term and she believes in monogamy.",
    "user_id": "24ad95cc-91a6-475c-8f2f-b6ed1892a8b5"
}
