{
    "name": "Theodore Heath",
    "age": 29,
    "height": "6'0\"",
    "school": "California State University",
    "job_industry": "Technology",
    "job_title": "Software Engineer",
    "hometown_location": "San Francisco, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Honesty",
        "Humor",
        "Intelligence"
    ],
    "interests": [
        "Outdoor Activities",
        "Video Games",
        "Reading"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Moderate",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Man",
    "pronouns": "He/Him/His",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Pisces",
    "mbti_personality_type": "INTJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 24,
        "maximum_age": 31,
        "minimum_height": "5'5\"",
        "maximum_height": "6'0\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Sometimes",
        "gender": "Woman",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Hispanic/Latino"
        ],
        "politics": [
            "Moderate"
        ],
        "job_industry": [
            "Education",
            "Technology",
            "Healthcare"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Honesty",
            "Kindness",
            "Intelligence"
        ],
        "interests": [
            "Outdoor Activities",
            "Music",
            "Reading"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "This user is a 29-year-old Software Engineer in the Technology industry based in Los Angeles, California, but originally from San Francisco. He stands 6 feet tall and is a graduate from the California State University. He identifies as a straight white Caucasian man who uses the pronouns He/Him/His, with agnostic religious beliefs, and a moderate political stance. He values honesty, humor, and intelligence and enjoys outdoor activities, video games, and reading in his spare time. This user is a Pisces and his MBTI personality type is INTJ. Despite being occasionally up for a drink, he does not smoke or use drugs, including marijuana. He leads an active lifestyle and owns a dog. His desires for the future include having children, as he currently doesn't have any. He's also open to a long-term, monogamous relationship. His primary languages are English and Spanish.",
    "preferences_summary": "The user is seeking a female partner aged 24 to 31 years who falls between the heights of 5'5\" and 6'0\". She doesn't have children but must be open to having them in the future. An ideal match would be a straight woman who occasionally drinks but doesn't smoke or use marijuana or other drugs. Light to moderate exercise habits are preferred. Ethnicity-wise, he is open to dating women of both White Caucasian and Hispanic/Latino backgrounds. In terms of political inclination, he prefers a woman with moderate views. Professionally, he prefers women working in the Education, Technology, or Healthcare industry. Fluency in English is a must, and he values Honesty, Kindness, and Intelligence. Shared interests might include outdoor activities, music, or reading. Education is important too, with a preference for woman who have at least an undergraduate degree or higher. He is looking for a long-term relationship that is monogamous.",
    "user_id": "7e2db856-7115-4128-a071-77c61546d74a"
}
