{
    "name": "Daliso Ngoma",
    "age": 32,
    "height": "5'10\"",
    "school": "Princeton University",
    "job_industry": "Technology",
    "job_title": "Software Engineer",
    "hometown_location": "Lusaka, Zambia",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Bemba"
    ],
    "values": [
        "Adventure",
        "Creativity",
        "Independence"
    ],
    "interests": [
        "Photography",
        "Hiking",
        "Traveling",
        "Reading"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Man",
    "pronouns": "He/Him/His",
    "sexuality": "Straight",
    "ethnicity": "Black African Descent",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog",
        "Fish"
    ],
    "zodiac_sign": "Virgo",
    "mbti_personality_type": "INTJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 26,
        "maximum_age": 35,
        "minimum_height": "5'2\"",
        "maximum_height": "6'0\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Sometimes",
        "gender": "Woman",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "Any"
        ],
        "politics": [
            "Not political"
        ],
        "job_industry": [
            "Any"
        ],
        "languages_spoken": [],
        "values": [
            "Honesty",
            "Kindness",
            "Sociability"
        ],
        "interests": [
            "Anything creative",
            "Health & Fitness",
            "Trying new things"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "This user is a 32-year-old man who identifies as straight and goes by the pronouns he/him/his. He stands at a height of 5'10\" and is of Black African descent from Lusaka, Zambia. He is currently based in Los Angeles, California, working in the field of Technology as a Software Engineer after studying at Princeton University up to the graduate level. For him, adventure, creativity, and independence are deeply valued, aside from his interests in photography, hiking, traveling, and reading. Though he speaks English and Bemba, he is an agnostic who aligns with liberal politics. While he's striving for long-term monogamy and wishes to have kids in the future, he currently doesn't have any and lives with his pet dog and fish. As a Virgo and an INTJ from the MBTI categories, he leads an active lifestyle but only drinks occasionally without engaging in smoking, marijuana, or illegal drugs.",
    "preferences_summary": "The user has certain characteristics in mind for a potential partner. He is interested in a woman, aged between 26 and 35 years, with a height in the range of 5'2\" to 6'0\". Ideally, his dating partner has no children but shared sentiment towards wanting children in the future. Besides, he prefers individuals leading a healthy life evidenced by occasional drinking and no use of marijuana, drugs, or smoking. Exercise should be a fortnightly routine for her conforming to a non-political ethos. Their maximum compatibility is likely if she is ready to get committed to a monogamous, 'long term' relationship. Job industry, ethnicities, and languages spoken matter less for the user, favoring inclusion and diversity, however, he emphasizes factors such as honesty, kindness, and sociability aligning with his value system. Creative pursuits, inclination towards health & fitness workouts and eagerness to try new things would increase the likelihood of respective interests matching. Lastly, her academic qualifications could range anywhere from being an undergraduate to a graduate.\n",
    "user_id": "56f9f4d6-fb2d-4ffb-b6a3-33a7aafd722e"
}
