{
    "name": "Priyanka Banerjee",
    "age": 28,
    "height": "5'6\"",
    "school": "University of Mumbai",
    "job_industry": "Information Technology",
    "job_title": "Software Developer",
    "hometown_location": "Mumbai, India",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Hindi",
        "Bengali"
    ],
    "values": [
        "Honesty",
        "Integrity",
        "Work-life balance"
    ],
    "interests": [
        "Coding",
        "Yoga",
        "Traveling"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Hindu",
    "politics": "Moderate",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "South Asian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Virgo",
    "mbti_personality_type": "INTP",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 35,
        "minimum_height": "5'8\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "South Asian",
            "White Caucasian",
            "East Asian",
            "Middle Eastern"
        ],
        "politics": [
            "Moderate"
        ],
        "job_industry": [
            "Information Technology",
            "Finance",
            "Education"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Honesty",
            "Integrity",
            "Passion for work",
            "Family Oriented"
        ],
        "interests": [
            "Technology",
            "Traveling",
            "Sports",
            "Reading"
        ],
        "education_level": [
            "Graduate",
            "Doctoral"
        ]
    },
    "profile_summary": "The user is a 28-year-old South Asian woman who stands at 5'6\". She speaks English, Hindi, and Bengali fluently, having been raised in Mumbai, India, where she also attended the University of Mumbai. Now, she works in the Information Technology industry as a Software Developer and lives in Los Angeles, California. Her interests include coding, yoga, and traveling, and she values honesty, integrity, and work-life balance highly. She's a devout Hindu and politically identifies as a moderate. She's looking for a long-term, monogamous relationship. Drinking socially is okay for her, but she's a solid no on smoking, marijuana, and other drugs. She's active and maintains a regular exercise regimen. She's a proud Virgo and an INTP (Myers-Briggs Type). She identifies as heterosexual and uses the pronouns She/Her/Hers. She does not have any children yet, but she would like to start a family someday. She owns a cat and would ideally like to settle down with a man between the ages 28 and 35.",
    "preferences_summary": "The user is looking for a man aged between 28 and 35, with a height ranging from 5'8\" to 6'2\". Her potential partner should not have children currently but should want them in the future. They should also be straight and only drink occasionally, engaging in regular exercise, and not smoking or using marijuana or drugs. The user prefers a partner who is oriented towards a long-term relationship and practices monogamy. She is open to dating South Asian, White Caucasian, East Asian, or Middle Eastern men who tend to be moderate politically. Ideal job industries for her partner are Information Technology, Finance, or Education. Her partner should preferably be well-educated, having at least a graduate or doctoral degree. The user expects her partner to share her values such as honesty and integrity along with a passion for work and a family-focused approach. English should be one of the languages her partner speaks. The potential partner's interests should align with technology, traveling, sports, and reading.",
    "user_id": "9f503127-e281-48c5-baad-f5889b443aaf"
}
