{
    "name": "Christina Klinger",
    "age": 30,
    "height": "5'7\"",
    "school": "University of Southern California",
    "job_industry": "Law",
    "job_title": "Attorney",
    "hometown_location": "Denver, Colorado",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Honesty",
        "Charity",
        "Creativity"
    ],
    "interests": [
        "Cooking",
        "Yoga",
        "Photography"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Life partner",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Pisces",
    "mbti_personality_type": "ENFP",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 30,
        "maximum_age": 40,
        "minimum_height": "5'8\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Yes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Life partner",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Hispanic/Latino"
        ],
        "politics": [
            "Liberal"
        ],
        "job_industry": [
            "Law",
            "Education",
            "Healthcare"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Honesty",
            "Creativity",
            "Adventure"
        ],
        "interests": [
            "Fitness",
            "Reading",
            "Cooking"
        ],
        "education_level": [
            "Graduate",
            "Doctoral"
        ]
    },
    "profile_summary": "This user is a 30-year-old woman who stands at 5'7\", and identifies as straight. She is a practicing attorney after graduating from the University of Southern California. Born and raised in Denver, Colorado, she currently resides in Los Angeles, California. She prides value on honesty, charity, and creativity, and in her spare time, she likes to do cooking, photography, and yoga. The user is bilingual and speaks both English and Spanish fluently. Being an agnostic and declaring herself as a liberal, she's on a quest for a life partner who is more inclined towards monogamous relationships. With a Piscean sun sign and having an ENFP personality type, the user admits that she occasionally enjoys drinking, but refrains from smoking, marijuana, and drugs. Displaying an active nature towards exercise, she loves and probably owns a cat. This woman is open to having children and wants to have them someday.",
    "preferences_summary": "The user is seeking to date a man aged between 30 to 40 years old, standing between 5'8\" and 6'2\" in height. It's preferred for this potential partner to have no children but wants children in the future. He should be straight, a drinker but not a smoker, non user of marijuana or hard drugs, and should maintain an active lifestyle. His ethnicity should either be White Caucasian or Hispanic/Latino. His political views should align with liberal ideologies. He should work in either Law, Education, or Healthcare industries. As far as language is concerned, he must speak English. Substantial value should be placed on the traits of honesty, creativity, and adventure. His interests should count fitness, reading, and cooking among others. Finally, the ideal dating partner should be educated to the level of a graduate degree or higher. The intention should be to find a life partner, as per the user's relationship type set on considering just monogamy.",
    "user_id": "4350c036-218f-448b-8cef-3f7c8dae63f0"
}
