{
    "name": "Liana Hawthorne",
    "age": 28,
    "height": "5'6\"",
    "school": "Stanford University",
    "job_industry": "Technology",
    "job_title": "Software Engineer",
    "hometown_location": "San Francisco, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Transparency",
        "Being respectful and considerate",
        "Civic duty",
        "Creativity"
    ],
    "interests": [
        "Hiking",
        "Coding",
        "Craft Beer",
        "Volunteering"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog",
        "Cat"
    ],
    "zodiac_sign": "Scorpio",
    "mbti_personality_type": "ENTJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 35,
        "minimum_height": "5'8\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Hispanic/Latino",
            "East Asian",
            "Middle Eastern"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Technology"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Transparency",
            "Being respectful and considerate"
        ],
        "interests": [
            "Hiking",
            "Running",
            "BBQ",
            "Music",
            "Traveling"
        ],
        "education_level": [
            "Graduate",
            "Other"
        ]
    },
    "profile_summary": "This profile belongs to a 28-year-old software engineer in the technology field who calls San Francisco home but is currently dating in Los Angeles. She is a graduate of Stanford University and, linguistically, speaks both English and Spanish. Valuing transparency, being respectful and considerate, civic duty, and creativity, this Scorpio (of ENTJ Personality) and her interests lie in hiking, coding, craft beer, and volunteering. Politically, she leans liberal and, religiously, considers herself agnostic. As an active woman of White Caucasian ethnicity, she discusses her personal life revealing that she is straight, goes by the pronouns she/her/hers, doesn't smoke, drinks sometimes and doesn't use marijuana drugs. When discussing family, she discloses not having children but admitting wanting them in the future, and lives with her pets, a dog and a cat. She is on a hunt for a long-term, monogamous relationship.",
    "preferences_summary": "This user is interested in a man aged between 28 and 35 years old, and prefers a minimum height of 5'8\" and maximum height of 6'2\". She is looking to meet a straight single partner, who does has no kids but does have future intentions to be a parent. Her ideal partner occasionally drinks alcoholic beverages but doesn't participate in smoking, marijuana, and substance uses. She prefers someone active, just like her. As for ethnicity, she is expectedly open to dating White Caucasians, Hispanic/Latinos, East Asians, and Middle Easterners. Politically, she's looking for a partner who identifies as liberal or moderate, preferably working in the technology sector and speaking at least the English language, in line with her own industry and language capabilities. Shared values are regarded as essential too, prioritizing transparency and being respectful and considerate. In the leisure categories, she seems to appreciate partners who are enthusiasts of hiking, running, BBQ, music, and traveling. As for education, she'd like her partner to be on the same academic wavelength, looking for someone stable in a graduate or advanced-level degree realm. In terms of intentions, she is intent on seeking someone for a long-term, monogamous relationship.",
    "user_id": "33825181-17cd-4984-9b41-147d7efccc12"
}
