{
    "name": "Fatima Al-Rashid",
    "age": 29,
    "height": "5'5\"",
    "school": "New York University",
    "job_industry": "Public Health",
    "job_title": "Epidemiologist",
    "hometown_location": "Riyadh, Saudi Arabia",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "Arabic",
        "English",
        "French"
    ],
    "values": [
        "Faith",
        "Humanitarianism",
        "Knowledge"
    ],
    "interests": [
        "Traveling",
        "Sculpture",
        "Reading"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Muslim",
    "politics": "Moderate",
    "dating_intentions": "Life partner",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "Middle Eastern",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Aquarius",
    "mbti_personality_type": "INFJ",
    "drinking": "No",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 30,
        "maximum_age": 40,
        "minimum_height": "5'8\"",
        "maximum_height": "6'4\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "No",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Life partner",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "Middle Eastern",
            "White Caucasian"
        ],
        "politics": [
            "Moderate"
        ],
        "job_industry": [
            "Medicine",
            "Engineering",
            "Education",
            "Law"
        ],
        "languages_spoken": [
            "Any"
        ],
        "values": [
            "Faith",
            "Dedication",
            "Philanthropy"
        ],
        "interests": [
            "Any"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate",
            "Doctoral"
        ]
    },
    "profile_summary": "This 29 year-old woman, an epidemiologist in the public health sector, studied at New York University. Hailing from Riyadh, Saudi Arabia, she now resides in Los Angeles, California. Not only is she trilingual, speaking Arabic, English, and French, she is also deeply committed to values like faith, humanitarianism, and knowledge. In her leisure time, she enjoys traveling, sculpture and reading. Being a Muslim, her faith is an integral part of her identity. Politically, she identifies as moderate. She's interested in a life-long relationship with a like-minded partner, preferring a monogamous relationship type. Openly a straight woman, she espouses the pronouns She/Her/Hers. She is an active woman who doesn't drink, smoke, or indulge in drugs. She is an Aquarius, an INFJ personality type, has no children but is open to having some, and she has a cat. Her preferred partner would also need to share her views about not consuming alcohol, marijuana, or drugs, and should enjoy an active or exercise-inclusive lifestyle.",
    "preferences_summary": "The user is looking for a man who is between 30 and 40 years of age, and stands between 5'8\" and 6'4\" tall. The potential partner should not have children but should want to have children in the future. He must be straight, teetotaller, non-smoker, does not use marijuana or drugs, and is actively involved in physical exercise. The user is open to partners of Middle Eastern or White Caucasian ethnicity and they should be ideologically moderate in politics. The desired partner should be working in either Medicine, Engineering, Education, or Law industries. Languages spoken is not a point of concern for the user. The preferred partner must value faith, dedication, and philanthropy. Their list of interests can be diverse with no specific requirements. The user prefers her partner to be at least an undergraduate.",
    "user_id": "2f1802a9-d087-43bd-b6ec-3f40eecb8460"
}
