{
    "name": "Odhran O'Reilly",
    "age": 30,
    "height": "5'11\"",
    "school": "University of Dublin",
    "job_industry": "Healthcare",
    "job_title": "Physical Therapist",
    "hometown_location": "Dublin, Ireland",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Irish"
    ],
    "values": [
        "Family",
        "Authenticity",
        "Adventure"
    ],
    "interests": [
        "Hiking",
        "Community Volunteer",
        "Gardening"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Christian",
    "politics": "Moderate",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Man",
    "pronouns": "He/Him/His",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Cancer",
    "mbti_personality_type": "ISFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 25,
        "maximum_age": 35,
        "minimum_height": "5'0\"",
        "maximum_height": "6'0\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Woman",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "East Asian",
            "Hispanic/Latino",
            "Middle Eastern",
            "Black African Descent"
        ],
        "politics": [
            "Liberal",
            "Moderate",
            "Not political"
        ],
        "job_industry": [
            "Education",
            "Arts",
            "Healthcare"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Family",
            "Authenticity",
            "Adventure"
        ],
        "interests": [
            "Hiking",
            "Yoga",
            "Reading"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate",
            "Doctoral"
        ]
    },
    "profile_summary": "The user is a 30-year-old Christian man from Dublin, Ireland who is currently living in Los Angeles, California. He is a physical therapist in the healthcare industry and a graduate from the University of Dublin. His interests include hiking, community volunteering and gardening, and he places high importance on family, authenticity, and adventure. He speaks both English and Irish, believes in monogamy, and is interested in a long-term relationship. He identifies as a healthy, active individual, sometimes enjoys a drink, but doesn't smoke or use drugs. He is an ISFJ, working towards stability in life and supports moderate political views. With no kids at the moment, he is open to the idea of becoming a father and also enjoys the company of his pet dog. His zodiac sign is Cancer, illustrating him as emotional, intuitive and practically psychic; ruled by the moon and characterized by the crab, Cancer holds everything protected in their shell. He prefers using He/Him/His pronouns and identifies sexually as a straight male. His ethnicity is White Caucasian.",
    "preferences_summary": "The user is looking for a woman, aged 25 to 35, who is interested in a long-term monogamous relationship. She should have an active lifestyle and takes certain health criteria seriously: occasional drinking is fine, but no smoking, marijuana or other drug use. She should preferably work within the industries of education, arts, or healthcare. The potential partner should be of any ethnicity, including white Caucasian, East Asian, Hispanic/Latino, Middle Eastern, and Black African Descent, and should be of at least 5'0\" and no taller than 6'0\". Importantly, she should not have children yet but must want children in the future. Her education at the very least should be undergraduate, with interest in or beyond to graduate or doctoral levels. She should possess values tied to family, authenticity, and adventure, and speaks English. Spelling out DAIHWY (which stands for dating related abbreviation), her desirable traits are thus Dating: long term, Activity: hiking, yoga or reading, i.e., literary interest, Intention: interested in long-term monogamy. The looks don't matter to him much but importance of health criteria confirms Him majorly as a Health-focused, Wants: kids, Youthful (female aged between 25-35).\n",
    "user_id": "0d65a790-97fc-4b44-b639-e4095be5bff0"
}
