{
    "name": "Sophia Rodriguez",
    "age": 28,
    "height": "5'6\"",
    "school": "Stanford University",
    "job_industry": "Technology",
    "job_title": "Software Engineer",
    "hometown_location": "San Antonio, Texas",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Ambition",
        "Health",
        "Kindness"
    ],
    "interests": [
        "Cooking",
        "Drawing",
        "Boxing"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Catholic",
    "politics": "Moderate",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "Hispanic/Latino",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Libra",
    "mbti_personality_type": "ENFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 25,
        "maximum_age": 35,
        "minimum_height": "5'8\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Sometimes",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "Hispanic/Latino",
            "White Caucasian",
            "Black African Descent"
        ],
        "politics": [
            "Liberal",
            "Moderate",
            "Conservative"
        ],
        "job_industry": [
            "Technology",
            "Business",
            "Engineering"
        ],
        "languages_spoken": [
            "English",
            "Spanish"
        ],
        "values": [
            "Ambition",
            "Kindness",
            "Family"
        ],
        "interests": [
            "Cooking",
            "Travel",
            "Sports"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "The 28-year-old woman behind this dating profile is a forward-thinking Libra who boasts an ambitious spirit, a commitment to maintaining good health, and kind-heartedness. As a software engineer in the technology industry, she combines high-level academic knowledge she acquired from Stanford University with her passion for innovation, presenting an excellently-rounded skillset. Fluent in both English and Spanish, she cultivates her work-life balance with her love for cooking, boxing, and drawing. Although a proud citizen of San Antonio, Texas, she relocated to Los Angeles for love, and stays true to her Catholic faith. Principled in monogamy, she seeks a long-term relationship-- hoping to build a family one day. Never smoking nor using marijuana or drugs, she trusts in maintaining a healthy lifestyle. As an ENFJ, she hopes her potential companion also enjoys the occasional drink. While she doesn't currently have any children, she adores her dog. Despite her robust calendared life filled with her love for boxing, free moments spent cooking, admonishing her steadfast faith, she keeps her heart open, keen on fulfilling her natural maternal instincts one day.",
    "preferences_summary": "The user is seeking a man between the ages of 25 and 35 who is between 5'8\" and 6'2\" tall. The potential partner should not have children but should have the desire to have children in the future. They should be straight, only drink occasionally, and not smoke or use marijuana or drugs. The user prefers a partner who exercises at least sometimes. Regarding dating intentions, the person should be interested in a long-term relationship and trust in consistent monogamy. Accepted ethnicities are Hispanic/Latino, White Caucasian, and Black African Descent. The user is open to all political affiliations. Preferred job industries are Technology, Business, and Engineering.\n\nIn terms of cultural aspects, the prospective partner should capable of speaking English and Spanish. They should value Ambition, Kindness, and Family. Also, a person who enjoys cooking, travelling, and sports would be a perfect fit. In terms of education, she prefers either someone with an undergraduate or graduate degree.",
    "user_id": "220af3e7-9ab0-47b4-83bb-e8f0dee7f766"
}
