{
    "name": "Aaliyah Sanchez",
    "age": 27,
    "height": "5'4\"",
    "school": "University of California, Los Angeles",
    "job_industry": "Healthcare",
    "job_title": "Registered Nurse",
    "hometown_location": "Los Angeles, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Family",
        "Work-life balance",
        "Ambition"
    ],
    "interests": [
        "Gardening",
        "Reading",
        "Traveling"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Catholic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "Hispanic/Latino",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Virgo",
    "mbti_personality_type": "ISFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 27,
        "maximum_age": 35,
        "minimum_height": "5'7\"",
        "maximum_height": "6'4\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Sometimes",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "All"
        ],
        "politics": [
            "Liberal"
        ],
        "job_industry": [
            "All"
        ],
        "languages_spoken": [
            "English",
            "Spanish"
        ],
        "values": [
            "Family",
            "Work-life balance",
            "Ambition"
        ],
        "interests": [
            "All"
        ],
        "education_level": [
            "Graduate",
            "Doctoral"
        ]
    },
    "profile_summary": "The profile belongs to a 27-year-old straight woman, who resides in Los Angeles. She is a Registered Nurse working in the Healthcare sector, holds a Graduate degree from the University of California, Los Angeles, and balances her profession by pursuing interests in Gardening, Reading, and Traveling. She is bilingual, speaking both English and Spanish, powers her everyday conversations. She fancies a simple life, surrounded by family, and focuses on maintaining a work-life balance while aiming for her ambitions. Her deciding potentials in life are determined by her Virgo ambition and an ISFJ personality trait. While she enjoys a glass now and then, she doesn’t smoke, nor does she use marijuana or other drugs. She takes lifestyle and fitness seriously, keeping herself active, and is seeking to have children someday with a Kindred partner, respecting her choice for long term monogamous relationships. Her only current child, though, is a furry cat. Her beliefs are deeply influenced by the Catholic religion, and she identifies with the term Liberal politically.\n",
    "preferences_summary": "The user seeks a man aged between 27 and 35, standing between 5'7\" and 6'4\" in height. Her potential partner must be without children but wishes to have them in the future. She seeks a straight man with long-term dating intentions interested in monogamy. He should sometimes drink, not smoke, avoid marijuana and drugs, and engage in exercise to some extent. Thi user's not specific about her partner's ethnicity or job industry, but would prefer someone who is politically liberal. Further preferences include fluency in English and Spanish and that the partner holds the same values on family, work-life balance, and ambition. Educationally, her partner should at least be at the graduate level or above. In terms of interests, the user remains open.",
    "user_id": "6e365dda-b070-4e41-b0b6-364b116bdf36"
}
