{
    "name": "Amara Singh",
    "age": 32,
    "height": "5'8\"",
    "school": "University of California, Berkeley",
    "job_industry": "Healthcare",
    "job_title": "Pharmacist",
    "hometown_location": "San Francisco, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Punjabi",
        "Spanish"
    ],
    "values": "Family, health, and continual learning are all deeply important to me. I try to live my life with a deep sense of empathy and understanding for others.",
    "interests": "I enjoy reading, hiking, yoga, and exploring the culinary scene in LA. I'm also a huge fan of indie music and film festivals.",
    "education_level": "Graduate",
    "religious_beliefs": "Sikh",
    "politics": "Liberal",
    "dating_intentions": "Life partner",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "South Asian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "None"
    ],
    "zodiac_sign": "Leo",
    "mbti_personality_type": "INFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 30,
        "maximum_age": 40,
        "minimum_height": "5'10\"",
        "maximum_height": "6'5\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active"
    },
    "summary": "Amara Singh is a 32-year-old, 5'8\" woman who is a pharmacist. She is a graduate from the University of California, Berkeley. Originally from San Francisco, she currently resides in Los Angeles. Amara is fluent in English, Punjabi, and Spanish. Her core values are family, health, and lifelong learning, and she approaches life with empathy and understanding. Amara enjoys reading, hiking, yoga, exploring LA's food scene, and appreciates indie music and films. She is a Sikh and leans liberal politically. Amara is looking for a life partner and prefers monogamous relationships. She identifies as straight, uses she/her pronouns, and is of South Asian ethnicity. Amara does not have any children currently but would like to have them in the future. Her trasharoo sign is Leo and her MBTI personality type is INFJ. She occasionally drinks but doesn't smoke or use drugs.  She leads an active lifestyle and doesn't have any pets. When it comes to a partner, she is open to men between the ages of 30 to 40, who are 5'10” to 6’5”, do not currently have children, wish to have children, and lead an active lifestyle. Her partner should be a non-smoker, a moderate drinker at most, and refrain from drugs.",
    "user_id": "5b0c95fc-ae29-4657-80b2-380711055b56"
}
