{
    "name": "Mei-Ling Wu",
    "age": 28,
    "height": "5'5\"",
    "school": "Columbia University",
    "job_industry": "Technology",
    "job_title": "Software Engineer",
    "hometown_location": "Taipei, Taiwan",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Mandarin"
    ],
    "values": [
        "Independence",
        "Ambition",
        "Cultural Awareness"
    ],
    "interests": [
        "Coding",
        "Hiking",
        "International Cinema",
        "Traveling"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Buddhist",
    "politics": "Moderate",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "East Asian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "None"
    ],
    "zodiac_sign": "Virgo",
    "mbti_personality_type": "INTJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 27,
        "maximum_age": 35,
        "minimum_height": "5'5\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Middle Eastern",
            "East Asian",
            "South Asian",
            "Other"
        ],
        "politics": [
            "Liberal",
            "Moderate",
            "Not political",
            "Other"
        ],
        "job_industry": [
            "Technology",
            "Finance",
            "Engineering",
            "Doctor",
            "Lawyer"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Independence",
            "Ambition",
            "Cultural Awareness"
        ],
        "interests": [
            "Traveling",
            "Hiking",
            "Cinema",
            "Music"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate",
            "Doctoral",
            "Other"
        ]
    },
    "profile_summary": "This profile belongs to a 28-year-old woman who stands at 5'5\" and works as a Software Engineer in the technology industry. Originally from Taipei, Taiwan, she now resides in Los Angeles, California. She's a multilingual, speaking both English and Mandarin. She values Independence, Ambition, and Cultural Awareness. With a variety of interests including coding, hiking, international cinema, and traveling, she likes to stay active. A graduate from Columbia University, she holds advanced education in high regard and associates herself as a moderate in political views. From a religious standpoint, she's Buddhist. She is primarily interested in long-term dating leading to monogamy. She's heterosexual, identifies with East Asian ethnicity and doesn't have kids but express a desire to have some in the future. She doesn't own any pets and is a Virgo by zodiac sign. Her MBTI Personality type is INTJ. She occasionally drinks, doesn't smoke, and is not into marijuana or other drugs. Her health and fitness are important to her, and she maintains an active lifestyle.",
    "preferences_summary": "The user prefers a man between the ages of 27 and 35 who is straight, height ranging between 5'5\" and 6'2\", who does not have children but wishes to have them in the future. The ideal partner would not smoke, uses marijuana or other drugs, and drinks sometimes. They should be active in exercising. In terms of dating intentions, she is seeking a long-term monogamous relationship. Possible ethnic backgrounds include White Caucasian, Middle Eastern, East Asian, South Asian or Other. The prospective partner could have liberal, moderate, not political beliefs, or other political alignment. As for the job industry, her interest lies in those that are involved in technology, finance, engineering, medicine or law, with English as at least one of the languages they speak. The partner's values ought to align with hers consisting of independence, ambition, and cultural awareness. Mutual interests can be traveling, hiking, enjoying cinema, and music. She values education heavily, and prefers partners who have, at least, an undergraduate degree.",
    "user_id": "e820bab2-8061-43f8-8184-7846b93847d8"
}
