{
    "name": "Julia Baxter",
    "age": 30,
    "height": "5'6\"",
    "school": "University of Southern California",
    "job_industry": "Healthcare",
    "job_title": "Registered Nurse",
    "hometown_location": "San Francisco, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Trust",
        "Loyalty",
        "Compassion"
    ],
    "interests": [
        "Cooking",
        "Hiking",
        "Photography"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Christian",
    "politics": "Liberal",
    "dating_intentions": "Life partner",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Leo",
    "mbti_personality_type": "ENFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 29,
        "maximum_age": 40,
        "minimum_height": "5'6\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": false,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Life partner",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Hispanic/Latino"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Healthcare",
            "Education",
            "Engineering"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Trust",
            "Loyalty",
            "Compassion"
        ],
        "interests": [
            "Reading",
            "Hiking",
            "Traveling"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "The user is a 30-year-old woman who stands 5'6\" tall and identifies as a straight, white Caucasian. Professionally, she serves in the healthcare industry as a Registered Nurse and holds a graduate degree from the University of Southern California. Originally from San Francisco, she currently lives in Los Angeles and is seeking a life partner with the intention of monogamy. In terms of personal beliefs and lifestyle, she is a Christian, politically liberal, and values trust, loyalty, and compassion. A non-smoker who occasionally indulges in drinks, she doesn't use marijuana or other drugs and maintains an active exercise routine. Her hobbies are cooking, hiking, and photography, and she can converse fluently in English and Spanish. She doesn’t have children but is open to having some in the future. Her household includes a cat, and under the Leo zodiac sign, her Myers-Briggs type is ENFJ - known for being extroverted, intuitive, feeling, and judging.",
    "preferences_summary": "The ideal dating partner for this user should be a man aged between 29 and 40 and be within 5'6\" to 6'2\" in height. It's important that he doesn't have children and doesn't want them either. His sexuality should be straight and should keep an active lifestyle, just like the user. Occasional drinker is good but absolutely no smoking, marijuana, or drugs of any sort. He's expected to be monogamous with intentions of finding a lifelong partner. Professionals from healthcare, education, and engineering industries would most likely match the user's preference. Communication shouldn't be a problem as long as he speaks English. As for personal values, the top three would be trust, loyalty, and compassion. Having interests in reading, hiking, and traveling would be a plus. Lastly, it would be great if he has at least an undergraduate degree. Pieces of the puzzle will come together nicely if he's a white Caucasian or Hispanic/Latino and if his political leaning is liberal or moderate.",
    "user_id": "842053d6-d4d1-4434-9d63-c5478f2fc815"
}
