{
    "name": "Priya Patel",
    "age": 28,
    "height": "5'4\"",
    "school": "University of California, Berkeley",
    "job_industry": "Tech Startup",
    "job_title": "Software Developer",
    "hometown_location": "San Francisco, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Gujarati"
    ],
    "values": [
        "Family",
        "Health & Fitness",
        "Compassion",
        "Culture"
    ],
    "interests": [
        "Cooking",
        "Travel",
        "Reading",
        "Tech"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Hindu",
    "politics": "Moderate",
    "dating_intentions": "Life partner",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "South Asian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "None"
    ],
    "zodiac_sign": "Libra",
    "mbti_personality_type": "ENFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 35,
        "minimum_height": "5'5\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "No",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Life partner",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "South Asian",
            "White Caucasian",
            "Black African Descent"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Finance",
            "Tech",
            "Arts"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Family",
            "Compassion",
            "Culture"
        ],
        "interests": [
            "Cooking",
            "Outdoors",
            "Travel"
        ],
        "education_level": [
            "Graduate",
            "Doctoral"
        ]
    },
    "profile_summary": "The user is a 28-year-old woman who identifies as straight. She stands at 5'4\" and hails from San Francisco, California, but currently lives in Los Angeles, California. Professionally, she works as a Software Developer in a tech startup. She is an alumna of the University of California, Berkeley, and has attained a graduate level education. She identifies as a South Asian ethnicity and follows Hindu religious beliefs. \n\nBeing politically moderate, this straight woman values family, health & fitness, compassion, and culture. She enjoys cooking, travel, reading, and tech. Her relationship intention is to find a life partner. She's open to monogamy and is seeking someone to potentially have children with in the future, as she currently does not have any children. \n\nFluent in English and Gujarati, she leads an active lifestyle, partakes in drinking sometimes but does not indulge in smoking or using marijuana or other drugs. Being a Libra, she is an ENFJ according to the Myers–Briggs Type Indicator personality type. She has no pets.",
    "preferences_summary": "The user is interested in dating men aged 28 to 35 who are no shorter than 5'5\" and no taller than 6'2\". Her prospective partner should not have children but should want to have children in the future. He should be straight and not consume alcohol, smoke, or use marijuana or drugs. In terms of physical activity, he should lead an active lifestyle. \n\nThe user prefers men who intend to find a life partner and are open to a monogamous relationship. Ethnicity preferences are South Asian, White Caucasian, and Black African Descent. Politically, her potential partner may lean liberal or moderate. \n\nShe prefers someone who works in the finance, tech, or arts industry and who speaks English at a minimum. Her ideal partner shares her values of family, compassion, and culture and has interests in cooking, the outdoors, and travel. Educationally, she is looking for someone who attained at least a graduate degree.",
    "user_id": "d6c56ca7-8025-4ad6-9437-2902ce1b06b7"
}
