{
    "name": "Oliver Weston",
    "age": 28,
    "height": "6'1\"",
    "school": "University of California, Los Angeles",
    "job_industry": "Tech",
    "job_title": "Software Engineer",
    "hometown_location": "Austin, Texas",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English"
    ],
    "values": [
        "Family",
        "Love",
        "Innovation",
        "Balance"
    ],
    "interests": [
        "Cycling",
        "Coding",
        "Cooking",
        "Outdoor Adventures"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term, open to short",
    "relationship_type": "Monogamy",
    "gender": "Man",
    "pronouns": "He/Him/His",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Libra",
    "mbti_personality_type": "ENTP",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 24,
        "maximum_age": 32,
        "minimum_height": "5'2\"",
        "maximum_height": "6'0\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Yes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Woman",
        "dating_intentions": "Long term, open to short",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Hispanic/Latino",
            "East Asian"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Tech",
            "Healthcare",
            "Education"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Family",
            "Love",
            "Innovation",
            "Balance"
        ],
        "interests": [
            "Cooking",
            "Outdoor Adventures",
            "Art",
            "Travel"
        ],
        "education_level": [
            "Graduate",
            "Undergraduate"
        ]
    },
    "profile_summary": "The user is a straight, 28-year-old man with a Caucasian/White ethnicity, standing 6'1\" tall. He currently lives in Los Angeles, California, but he is originally from Austin, Texas. He completed his graduate studies at the University of California, Los Angeles, and now works in the tech industry as a Software Engineer. His pastimes include cycling, coding, cooking, and outdoor adventures. Possessing ENTP personality traits, he identifies as Agnostic politically prefers the Liberal side. Words that follow his nutrients of life include love, innovation, family, and balance. In his physical indiscretions, he drinks on occasions, nunca falls into fire's lighter hand or dribbles any semblance of drugs or marijuana. Despite his active schedule, he does manage time to be friends with our canine counterpart. He's looking forward to connecting with someone for a potentially long-term relationship bound with monogamy, and open to spreading spins' hushful joy—he wants children. His ideal partner should share his interests and values, embrace parallel pinpoint priorities with doctrines dovetailing dovishly dumbfound.",
    "preferences_summary": "The user is interested in dating a woman who is between the ages of 24 to 32 and a height range of 5'2\" to 6'0\". She should not have children but must be interested in having some in the future. Her sexuality should be straight and she should advocate for monogamy. Preference is given to women who drink, do not smoke or use marijuana and are not involved in drug usage. The woman should be active physically. Her ethnicity could be White Caucasian, Hispanic/Latino, or East Asian. Considering her political leanings, she could either be a Liberal or Moderate. The job sector could be Tech, Healthcare, or Education. Fluency in English is required. The woman should also value family, love, innovation, and balance. Some of her interests could include cooking, outdoor adventures, art, and travel. She must hold an education level of Graduate or Undergraduate.\n",
    "user_id": "6f950627-b519-43cb-ac01-a5a9b77e6739"
}
