{
    "name": "Zoe Armstrong",
    "age": 30,
    "height": "5'7\"",
    "school": "University of California, Berkeley",
    "job_industry": "Media",
    "job_title": "Journalist",
    "hometown_location": "Austin, Texas",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Empathy",
        "Innovation",
        "Authenticity"
    ],
    "interests": [
        "Writing",
        "Reading",
        "Traveling",
        "Fitness",
        "Arts"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Moderate",
    "dating_intentions": "Life partner",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "Hispanic/Latino",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Aquarius",
    "mbti_personality_type": "ENFP",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 40,
        "minimum_height": "5'7\"",
        "maximum_height": "6'3\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Yes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Life partner",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "Hispanic/Latino",
            "White Caucasian",
            "Black African Descent"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Media",
            "Arts",
            "Education"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Innovation",
            "Respect",
            "Empathy"
        ],
        "interests": [
            "Music",
            "Traveling",
            "Politics",
            "Literature"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "This woman is a 30-year-old accomplished journalist in the media industry, having graduated from the University of California, Berkeley. She is originally from Austin, Texas, but currently living and dating in Los Angeles, California. Known for her empathetic nature, innovative thinking, and authenticity, she specializes in connecting with people through her writing. Her interests involve writing, deeply exploring literary pieces, staying fit, indulging in arts, and globetrotting. Even though she is fluent in English and Spanish, she resonates strongly with her Hispanic roots. Spiritually, she identifies as being agnostic, and politically, she considers herself a moderate. She is interested in finding a life partner and prefers monogamous relationships. Being clean living by sometimes drink but doesn't engage anything to do with smoking or drugs. She places a significant emphasis on staying active, appreciates cats, and also wants to have children while not currently having any. As an Aquarius, she has a keen focus on an ENFP personality type.",
    "preferences_summary": "The user is interested in a man, age ranging between 28 - 40 years and maintaining an active lifestyle like herself. Ideally, her partner should be within a height range of 5'7\" - 6'3\". They shouldn't currently have children, but they should want children in the future. In terms of habits, her preferred partner drinks but does not smoke or use marijuana or any other drugs. They need to be straight, like her, looking for a life partner and ahead for a journey of monogamy. Preference in terms of ethnicity is inclusive of Hispanic/Latino, White Caucasian or Black African Descent. Politically liberal or moderate views are solicited. The ideal partner should work in the Media, Arts, or Education industry and must be a fluent English speaker. In relation to values, the potential partner should appreciate innovation, demonstrate respect as well as empathy. Shared interests could include music, traveling, politics, and literature. Lastly, the prospective partner should at least possess an undergraduate education level.",
    "user_id": "f92579d4-55be-4dd3-a4e2-718aa22845a2"
}
