{
    "name": "Naomi Takashi",
    "age": 28,
    "height": "5'6\"",
    "school": "University of Southern California",
    "job_industry": "Technology",
    "job_title": "Software Engineer",
    "hometown_location": "Sacramento, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Japanese"
    ],
    "values": [
        "Honesty",
        "Kindness",
        "Ambition"
    ],
    "interests": [
        "Technology",
        "Hiking",
        "Gaming",
        "Cooking"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "East Asian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Pisces",
    "mbti_personality_type": "INTJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 35,
        "minimum_height": "5'8\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Yes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Hispanic/Latino"
        ],
        "politics": [
            "Liberal"
        ],
        "job_industry": [
            "Technology",
            "Healthcare"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Honesty",
            "Kindness",
            "Ambition"
        ],
        "interests": [
            "Technology",
            "Travel",
            "Outdoor activities"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "This is a profile for a 28-year-old woman who is 5'6\", of East Asian ethnicity, and a graduate of the University of Southern California. She is a Software Engineer in the technology sector, speaks English and Japanese, and is based in Los Angeles, California. Her interests include technology, hiking, gaming, and cooking. With a liberal political leaning and agnostic religious beliefs, she values honesty, kindness, and ambition. Identifying herself as Straight, she is seeking for a long-term relationship with preference given to monogamy. Though she does not have children, she is open to having them in the future. She is a pet lover and has a cat. Her other details include; Pisces zodiac sign, INTJ as her Myers-Briggs personality type, occasional drinking while refraining from smoking and drugs. In terms of fitness, she has an active exercise routine.",
    "preferences_summary": "This individual is seeking a man between the ages of 28 and 35, who is 5'8'' to 6'2'' in height. Her potential partner should not have any children but must want to have children in the future, and he should be interested in maintaining an active lifestyle. She would prefer her partner not to smoke or use drugs or marijuana, but occasional drinking is fine for her. Regarding sexual orientation, she is interested in straight men. Her dating intentions are long term, and she upholds the value of monogamy in a relationship. She prefers her potential match to be of White Caucasian or Hispanic/Latino descent, intending to find a partner with liberal political views, someone involved in the Technology or Healthcare industry. Required languages are English. She is looking for a man who values honesty, kindness, and ambition. It will be favorable if her potential match is interested in technology, traveling, and outdoor activities, and has achieved undergraduate level education at least.",
    "user_id": "b5ba1df2-76e5-4bc7-acf1-f6c5f271715b"
}
