{
    "name": "Blake Hopkins",
    "age": 32,
    "height": "6'1\"",
    "school": "University of California, Berkeley",
    "job_industry": "Technology",
    "job_title": "Software Engineer",
    "hometown_location": "San Francisco, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Honesty",
        "Ambition",
        "Adventure"
    ],
    "interests": [
        "Coding",
        "Basketball",
        "Camping",
        "Music",
        "Photography"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Man",
    "pronouns": "He/Him/His",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Virgo",
    "mbti_personality_type": "INTP",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 26,
        "maximum_age": 35,
        "minimum_height": "5'4\"",
        "maximum_height": "6'0\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Yes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Sometimes",
        "gender": "Woman",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Hispanic/Latino",
            "East Asian"
        ],
        "politics": [
            "Liberal"
        ],
        "job_industry": [
            "Healthcare",
            "Education",
            "Technology",
            "Finance"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Honesty",
            "Ambition",
            "Passionate"
        ],
        "interests": [
            "Music",
            "Fitness",
            "Outdoor activities",
            "Technology"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "This user is a 32-year-old man who stands 6'1\" tall and works as a software engineer in the tech industry. He prefers to use He/Him/His pronouns, identifies as straight, and his ethnic background is White Caucasian. He did his graduation from the University of California, Berkeley, and resides in San Francisco, California, but wishes to date in Los Angeles. He speaks fluent English and Spanish. When it comes to core values, he values Honesty, Ambition, and Adventure. Some of his favorite activities involve coding, playing basketball, camping, listening to music, and photography. He identifies himself as an Agnostic politically Lean Liberal and also goes by the Star sign Virgo and an INTP personality type. He only drinks occasionally, does not smoke or consume marijuana and completely a no for other drugs. He has an active lifestyle and keeps by engaging in exercises regularly. He lives with his pet dog, has no children at present, however evidently looks forward to having kids in the future, hinting his interest in a monogamous and long-term serious relationship.",
    "preferences_summary": "The user is looking for a woman, who is interested in a monogamist, long-term relationship and aged between 26 to 35 years old. The ideal match for the user should be a non-smoker and non-drug user, though occasional drinking is welcome. Importantly, she should share similar values to the user, such as honesty and ambition, and should have the desire to have children in the future. Speaking English and having some degree of fitness involvement, the user's ideal partner would boast interests in music, outdoor activities, and technology. Her height should ideally range from 5'4'' to 6'0'' and her ethnicity may be either White Caucasian, Hispanic/Latino, or East Asian. From a professionalism perspective, she should associate with the Healthcare, Education, Technology, or Finance industries - ideally having an Undergraduate or Graduate degree. The user's aspiring partner may hold Liberal political beliefs.",
    "user_id": "8c1d14ad-ecaf-4a00-bdc1-415733b74d59"
}
