{
    "name": "Caitlin O'Brien",
    "age": 29,
    "height": "5'5\"",
    "school": "University of Chicago",
    "job_industry": "Healthcare",
    "job_title": "Registered Nurse",
    "hometown_location": "San Diego, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Family",
        "Honesty",
        "Understanding"
    ],
    "interests": [
        "Yoga",
        "Travel",
        "Reading"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Catholic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Sagittarius",
    "mbti_personality_type": "ENFP",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 38,
        "minimum_height": "5'7\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Black African Descent",
            "East Asian",
            "Hispanic/Latino",
            "Middle Eastern",
            "Pacific Islander",
            "South Asian",
            "Southeast Asian",
            "Other"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Medical",
            "Law",
            "Art",
            "Finance",
            "Engineering"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Family",
            "Honesty",
            "Understanding"
        ],
        "interests": [
            "Exercise",
            "Travel",
            "Music",
            "Reading"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate",
            "Doctoral"
        ]
    },
    "profile_summary": "This individual is a 29-year-old straight woman with she/her pronouns. Standing at a height of 5'5\", she is of White Caucasian ethnicity and has graduated from the University of Chicago. She chose a career within the healthcare industry and currently works as a Registered Nurse in the bustling city of Los Angeles, California; but originally hails from San Diego. Additional abilities include bilingual proficiency in English and Spanish. Some things she exemplifies are her values like family focus, honesty, and capacity for understanding. Her free time often involves yoga, travel and delving into good books. As for her religious belief, she practices Catholicism, and emits liberal political views. While she currently doesn't have children, she holds the intention to have some in the future. Presently a content cat owner, and hails under the zodiac sign of Sagittarius while sporting an ENFP personality type. She leads an active lifestyle with sometimes induced alcohol drinking but chooses to remain a non-smoker with zero involvement in illicit substances. Hers primary intentions in dating are focused on finding a long-term partner-Pacific lurkingstablemonogamy.\n",
    "preferences_summary": "The user's ideal partner would be a man aged between 28 to 38 years, with a height ranging from 5'7\" to 6'2\". He must be straight, intending for a long-term relationship, and believes in monogamy. Preferred ethnicities include White Caucasian, Black African Descent, East Asian, Hispanic/Latino, Middle Eastern, Pacific Islander, South Asian, Southeast Asian, and others as well. He may be of liberal or moderate political views and works in the medical, law, art, finance, or engineering industry, speaking English as a prerequisite. It's imperative that he doesn't have children and is open to having children in the future. It's also vital he joins the relationship valueing honesty, family, and understanding. The man most desired would have interests in exercising, traveling, music, and reading. He should not drink excessively and be a non-smoker, with no marijuana or drug usage, and should have an active lifestyle. As for his education background, an undergraduate degree or higher would be attractive. His willingness to be active in a future relationship could be fulfilling the woman's desirable lifestyle.",
    "user_id": "a752209b-adbc-4730-9788-1654034dec2c"
}
