{
    "name": "Lyla Henderson",
    "age": 30,
    "height": "5'7\"",
    "school": "University of California, Los Angeles",
    "job_industry": "Technology",
    "job_title": "Software Engineer",
    "hometown_location": "Pasadena, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "French"
    ],
    "values": [
        "Honesty",
        "Compassion",
        "Integrity"
    ],
    "interests": [
        "Reading",
        "Hiking",
        "Coding"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Atheist",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Cancer",
    "mbti_personality_type": "INTP",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 40,
        "minimum_height": "5'8\"",
        "maximum_height": "6'3\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Yes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian"
        ],
        "politics": [
            "Liberal"
        ],
        "job_industry": [
            "Technology"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Honesty",
            "Compassion",
            "Integrity"
        ],
        "interests": [
            "Reading",
            "Hiking",
            "Coding"
        ],
        "education_level": [
            "Graduate"
        ]
    },
    "profile_summary": "This dating user is a 30-year old woman who goes by the she/her/hers pronouns. She is a 5'7\" white Caucasian with a graduate-level education. Originally from Pasadena, California and now residing in Los Angeles. She currently works as a Software Engineer within the technology sector following her studies at the University of California. An active individual, who occasionally enjoys a drink but abstains from smoking, uses of marijuana, and drugs. Not just a busy worker, she speaks both English and French, is a pet lover with a cat, and lists reading, hiking, and coding as some of her interests. This openly straight monogamous woman is looking for a long-term relationship. Honesty, compassion, and integrity make up for essential values while she identifies herself with liberal politics. Zodiac wise, she is a Cancer and identifies her personality type as INTP. Although she currently has no children, she is positively looking to have kids in the future.",
    "preferences_summary": "The user is looking for a man, aged between 28 and 40, with a height in the range of 5'8\" to 6'3\". Her preferred partner should hold the intention of getting into a long-term relationship and view relationships through a lens of monogamy. He should not have any children but must express a desire for children in the future. Expectations also line up in regards to lifestyle choices: the potential partner should partake in occasional drinking, lead an active lifestyle, and refrain from smoking, marijuana and drugs. Leaving room for shared values, the user's ideal partner should prioritize honesty, compassion, and integrity. Regarding interests, it would be preferable if he shares habits of reading, hiking, and coding. A graduate-level education, strong English language skills, and technology sector employment are required, and a political leaning towards liberal views is desired. Consequently, the user has a strong inclination toward Caucasian ethnicity.",
    "user_id": "91d04850-2a14-4291-af49-9af91af41dfd"
}
