{
    "name": "Fatima Abdullah",
    "age": 31,
    "height": "5'5\"",
    "school": "American University of Sharjah",
    "job_industry": "Healthcare",
    "job_title": "Pharmacist",
    "hometown_location": "Dubai, United Arab Emirates",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "Arabic",
        "English"
    ],
    "values": [
        "Education",
        "Career",
        "Adventure"
    ],
    "interests": [
        "Traveling",
        "Cooking",
        "Reading"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Muslim",
    "politics": "Moderate",
    "dating_intentions": "Life partner",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "Middle Eastern",
    "has_children": false,
    "want_children": true,
    "pets": [
        "None"
    ],
    "zodiac_sign": "Aquarius",
    "mbti_personality_type": "INFJ",
    "drinking": "No",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 28,
        "maximum_age": 36,
        "minimum_height": "5'7\"",
        "maximum_height": "6'3\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "No",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Life partner",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "Black African Descent",
            "Middle Eastern",
            "White Caucasian"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Law",
            "Finance",
            "Healthcare"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Loyalty",
            "Education",
            "Hard-Working"
        ],
        "interests": [
            "Traveling",
            "Cooking",
            "Exercising"
        ],
        "education_level": [
            "Graduate",
            "Doctoral"
        ]
    },
    "profile_summary": "This 31-year-old woman is a Pharmacist in the Healthcare industry and an alumni from the American University of Sharjah. Proudly originating from Dubai, United Arab Emirates, she is currently based in Los Angeles, California. Proficient in both Arabic and English, she profoundly values Education, Career, and Adventure. Her hobbies are broadly diversified and include traveling, cooking, and reading. A graduate by education, she practices the Muslim faith, and leans moderate in her political views. Her ultimate motive for dating is to find a life partner for monogamous association. Notably, she identifies as a straight, Middle Eastern woman who goes by the pronouns She/Her/Hers. Although she currently has no children, she eventually wants to have her own. As of now, she has no pets. She embodies the characteristics of an Aquarius and reflects an INFJ as her mbti personality type. She embraces an active lifestyle devoid of alcohol, cigarettes, marijuana, and any intoxicating drugs.",
    "preferences_summary": "The client is seeking a man in the dating age bracket of 28-36, with height ranging between 5'7\" and 6'3\". Her preferred partner would share her desire for children and lack of substance involvement (drinking, smoking, marijuana or drugs). Regarding activities, she'd like for them to also enjoy an active lifestyle for exercise. Ethnically, she signals an openness towards persons of Black African Descent, Middle Eastern, and White Caucasian backgrounds. Politically, Liberal and Moderate views gel best with her own. She's attracted to individuals rejecting monogamy within desirable industries like Law, Finance, and Healthcare, predominantly if English is among their spoken languages. Unity through shared values—having Loyalty, Education, and be Hard-Working figures importantly on her list. Also uniting over Interests (likes of Traveling, Cooking, and Exercising) generates greater excitement. Lastly, an educated partner, a Graduate or holding a Doctorate, suits her romance analysis.",
    "user_id": "18a1a433-94e7-43e0-a0ed-c212b513d30e"
}
