{
    "name": "Mohammed El-Sayed",
    "age": 30,
    "height": "6'1\"",
    "school": "University of Cairo",
    "job_industry": "Architecture",
    "job_title": "Architect",
    "hometown_location": "Cairo, Egypt",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "Arabic",
        "English",
        "French"
    ],
    "values": [
        "Good sense of humor",
        "Honesty",
        "Family-oriented"
    ],
    "interests": [
        "Traveling",
        "Art Galleries",
        "Architecture"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Muslim",
    "politics": "Moderate",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Man",
    "pronouns": "He/Him/His",
    "sexuality": "Straight",
    "ethnicity": "Middle Eastern",
    "has_children": false,
    "want_children": true,
    "pets": [
        "No"
    ],
    "zodiac_sign": "Aquarius",
    "mbti_personality_type": "ENTJ",
    "drinking": "No",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 25,
        "maximum_age": 33,
        "minimum_height": "5'2\"",
        "maximum_height": "6'0\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Sometimes",
        "gender": "Woman",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "East Asian",
            "Hispanic/Latino",
            "Middle Eastern",
            "White Caucasian"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Healthcare",
            "Documentary Filmmaking",
            "Education"
        ],
        "languages_spoken": [
            "Arabic",
            "English"
        ],
        "values": [
            "Integrity",
            "Loyalty",
            "Family-oriented"
        ],
        "interests": [
            "Art Baths",
            "Cooking",
            "Books"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "This 30-year-old gentleman, an Architect by profession, relates by he/him/his pronouns and identifies as straight. He stands tall at 6'1\", is of Middle Eastern ethnicity, currently residing in Los Angeles, however, originally from Cairo, Egypt. He is a graduate from the University of Cairo and prefers reaching out to singles who are interested in long-term monogamous relationships. He values honesty, a good sense of humor, and a family-oriented personality. His interests lie in architecture, art galleries, and traveling. Raised as a Muslim, he identifies as a political moderate and is an ENTJ (Extraversion, Intuition, Thinking, Judgment) as per Myers-Briggs typology. He does not smoke, drink or intake any drugs or marijuana, and leads an active physical routine. He appeals to a woman who is serious and committed, and possibly sees a delightful future which includes children as he does not currently have any but is open to having some in the future. Of all zodiac signs, he’s an Aquarius andis quite comfortable communicating in Arabic, English, and French. He has no pets at home.\n",
    "preferences_summary": "The ideal dating partner for the user is a woman aged between 25 and 33, with a height from 5'2\" to 6'0\". She should not have children but would like to have them in the future and should identify herself as straight. She's admired if she's a non-smoker, doesn't use marijuana or drugs, exercises occasionally, and enjoys a drink from time to time. The woman should have intentions for a long-term relationship and subscribe to monogamy. Her ethnicity would ideally be East Asian, Hispanic/Latino, Middle Eastern, or White Caucasian, and she might fall on the liberal or moderate side of the political spectrum. She could be working in Healthcare, Documentary Filmmaking, or Education. The user desires that she speaks Arabic and English. The key values in the woman are integrity, loyalty, and being family-oriented; she should enjoy creating art baths, cooking, and reading books. At last, the woman should have achieved an undergraduate or a graduate level of education.\n",
    "user_id": "98d6aecd-66d5-4bb6-80cf-dc934d7050ae"
}
