{
    "name": "Gretchen Wiley",
    "age": 31,
    "height": "5'8\"",
    "school": "University of California, Berkeley",
    "job_industry": "Healthcare",
    "job_title": "Pediatric Nurse",
    "hometown_location": "Sacramento, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Honesty",
        "Compassion",
        "Hard Work"
    ],
    "interests": [
        "Traveling",
        "Reading",
        "Yoga",
        "Hiking",
        "Cooking"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Cancer",
    "mbti_personality_type": "ENFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 30,
        "maximum_age": 40,
        "minimum_height": "5'8\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "Black African Descent",
            "East Asian",
            "Hispanic/Latino",
            "Middle Eastern",
            "Native American",
            "Pacific Islander",
            "South Asian",
            "Southeast Asian",
            "White Caucasian"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Healthcare",
            "Education",
            "Technology",
            "Finance"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Honesty",
            "Compassion",
            "Hard Work"
        ],
        "interests": [
            "Traveling",
            "Reading",
            "Fitness",
            "Cooking"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "At 31, this straight, white Caucasian woman, stands at 5'8\" and is both an ambitious pediatric nurse in the healthcare field and an active individual who enjoys traveling, reading, yoga, hiking, and cooking. She grew up in Sacramento, California, but is now dating in Los Angeles, California. She has a graduate degree from the University of California, Berkeley, and prides herself on being a bilingual speaker of English and Spanish. She is a dog owner who enjoys the occasional drink but does not smoke, use marijuana, or indulge in drugs. Her MBTI personality type labels her as an ENFJ, and she finds her core values to be honesty, compassion, and hard work. Although she doesn't currently have children, she’s open to the idea in the future. Her spirituality is defined as agnostic under the zodiac constellation, Cancer, and her political views lean liberal. She expects any potential relationship to be monogamous and is looking for a long-term connection.",
    "preferences_summary": "The user is seeking a man aged between 30 to 40 years who is interested in a long-term monogamous relationship. This potential partner should stand between 5'8\" and 6'2\" in height and does not currently have any children, though he should want them in the future. The user is open to dating men of various ethnicities, they include Black African Descent, East Asian, Hispanic/Latino, Middle Eastern, Native American, Pacific Islander, South Asian, Southeast Asian, and White Caucasian. Valuing healthy habits, she has a preference for non-smokers who do not use marijuana or any other drugs and maintain an active lifestyle. The preferred partner should occasionally drink. Politically, he should lean liberal or moderate. A potential partner should work within the Healthcare, Education, Technology, or Finance industry. English should be one of his spoken languages. It's important that he mirrors her core values of honesty, compassion, and hard work and shares some of her interests, such as traveling, reading, fitness, and cooking. As for education, he should have graduated from an undergraduate or graduate program.",
    "user_id": "90ef8e52-aa8b-4fc7-8b8c-ba8ccfea4135"
}
