{
    "name": "Simone Rodriguez",
    "age": 34,
    "height": "5'6\"",
    "school": "California State University, Los Angeles",
    "job_industry": "Entertainment",
    "job_title": "Production Assistant",
    "hometown_location": "Phoenix, Arizona",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": "Honesty, ambition, and kindness are very important to me. I believe in creating a balance in life and always staying true to oneself.",
    "interests": "I have varied interests; love outdoor activities on the weekend, enjoy music of all types, and have a soft spot for cookery shows. When I can, I take time out to travel to learn about different cultures.",
    "education_level": "Graduate",
    "religious_beliefs": "Catholic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Other",
    "ethnicity": "Hispanic/Latino",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Leo",
    "mbti_personality_type": "ENFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 30,
        "maximum_age": 40,
        "minimum_height": "5'5\"",
        "maximum_height": "6'2\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Other",
        "drinking": "Yes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active"
    },
    "summary": "Simone Rodriguez is a 34-year old production assistant in the Entertainment industry, living in Los Angeles, California. She values honesty, ambition, and kindness, and has varied interests such as outdoor activities, music, and cooking. Simone is a graduate from California State University, Los Angeles and is a Catholic with liberal political views. She identifies as a woman (her/she pronouns) with a 'yet to be disclosed' sexuality and is of Hispanic/Latino ethnicity. Simone does not have children but does want them in the future. She currently has a dog as a pet. Her lifestyle includes occasional drinking and participating in regular physical activity while avoiding tobacco and drugs. Simone is a Leo and her MBTI personality type is ENFJ. When it comes to a partner, Simone prefers someone between the age of 30-40. They should ideally also be interested in having children, engage in physical activity and may drink socially, but non-smoking is a must for her along with the exclusion of marijuana and other forms of drugs.    \n",
    "user_id": "8614817c-ab8b-4aeb-868a-156cff37654a"
}
