{
    "name": "Madison Harrington",
    "age": 28,
    "height": "5'6''",
    "school": "University of Southern California",
    "job_industry": "Software",
    "job_title": "Software Engineer",
    "hometown_location": "Boston, Massachusetts",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Japanese"
    ],
    "values": [
        "Fidelity",
        "Adventure",
        "Learning",
        "Kindness",
        "Respect",
        "Family",
        "Adventure",
        "Office jokes"
    ],
    "interests": [
        "Coding",
        "Anime",
        "Manga Reading",
        "Movies",
        "Musical Instrument - Piano"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "None",
    "politics": "Liberal",
    "dating_intentions": "Long term, open to short",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat"
    ],
    "zodiac_sign": "Taurus",
    "mbti_personality_type": "INTP",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 27,
        "maximum_age": 35,
        "minimum_height": "5'6''",
        "maximum_height": "6'3''",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Black African Descent",
            "East Asian",
            "Hispanic/Latino",
            "Middle Eastern"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "Software",
            "Media"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Discovery",
            "Learning",
            "Kindness",
            "Respect"
        ],
        "interests": [
            "Coding",
            "TV Shows",
            "Photography",
            "Food"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "The user is a 28-year-old woman who identifies as straight and prefers the pronouns she/her/hers. She originates from Boston, Massachusetts but resides in Los Angeles, California. Professionally, she is a Software Engineer,  and holds a Graduate degree from the University of Southern California. This adventurous yet respectful Taurus holds a variety of interests including coding, anime, manga, movies, and playing the piano, showcasing elements of a typical INTP personality. She speaks both English and Japanese and is of a White Caucasian ethnicity. Fitness and active lifestyle is important to her, as well as practicing careful moderation when it comes to occasional drinking; specifically, she refrains from smoking, marijuana use and drugs. She doesn't have children but embraces the prospect of having them in the future. While she doesn't subscribe to any religious fuel, her political views lean towards liberalism. Ultimately, she seeks a long-term monogamous relationship but may consider a short-term one. Lastly, she's a proud pet owner of a cat.",
    "preferences_summary": "The user is seeking a man aged between 27 and 35 years who stands height between 5'6'' to 6'3''. She prefers someone who doesn't have children but is keen on having them in the future. Her preference revolves around straight, active individuals who sometimes drink, but significantly steer clear of smoking, marijuana, and drug usage. Politically, she inclines toward either liberal or moderate profiles and prioritizes ethnicity either white Caucasian, black African descent, East Asian, Hispanic/Latino, or Middle Eastern. Ideally, her partner should operate within the software or media job industry and should have at least completed an undergraduate degree, if not graduated. She desires a partner who places a high value on discovery, learning, kindness, and respect, and speaks English at the minimum. Shared interests in Coding, TV Shows, photography, and food would be appealing to her, looking for a long-term relationship based on mutual monogamy.",
    "user_id": "2536febb-265b-4862-bed3-ba466e231239"
}
