{
    "name": "Violet McCarthy",
    "age": 29,
    "height": "5'7\"",
    "school": "University of California, Los Angeles",
    "job_industry": "Healthcare",
    "job_title": "Nurse Practitioner",
    "hometown_location": "Fresno, California",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "Spanish"
    ],
    "values": [
        "Family",
        "Work-Life balance",
        "Science-based reasonings"
    ],
    "interests": [
        "Yoga",
        "Road Trips",
        "Cooking"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Woman",
    "pronouns": "She/Her/Hers",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Cat",
        "Dog"
    ],
    "zodiac_sign": "Leo",
    "mbti_personality_type": "ENFJ",
    "drinking": "Sometimes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 27,
        "maximum_age": 35,
        "minimum_height": "5'8\"",
        "maximum_height": "6'4\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Active",
        "gender": "Man",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "White Caucasian",
            "Native American",
            "Asian",
            "Black African Descent"
        ],
        "politics": [
            "Liberal"
        ],
        "job_industry": [
            "Healthcare",
            "Education",
            "Art"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Family",
            "Work-Life balance",
            "Supportive"
        ],
        "interests": [
            "Travel",
            "Healthy Eating",
            "Art"
        ],
        "education_level": [
            "Graduate",
            "Undergraduate"
        ]
    },
    "profile_summary": "The user is a 29-year-old woman who hails from Fresno, California but currently resides in Los Angeles. She is straight and identifies her pronouns as She/Her/Hers. She possesses a graduate degree from the University of California, Los Angeles and works diligently as a Nurse Practitioner in the healthcare industry. Fluent in English and Spanish, she takes pride in her White Caucasian ethnicity. She follows Liberal political views and identifies as Agnostic when it comes to religious beliefs. Her core values include family, work-life balance, and science-based reasoning. In her leisure time, she enjoys Yoga, going on road trips, and cooking. She has never had children but desires to in the future. She owns a cat and a dog and is an active lifestyle enthusiast. Although she occasionally drinks, she does not use tobacco, marijuana, or other drugs. She belongs to the Leo zodiac sign, has an ENFJ personality type, and is interested in a monogamous and long-term relationship.",
    "preferences_summary": "The user is seeking a man aged between 27 to 35 years, who is at least 5'8'' to 6'4'' in height. He should have no children but want to have them in the future. Her preferred partner must be straight, drink sometimes, but abstain from smoking, marijuana, and drugs, while maintaining an active physical exercise regime. The partner should also be interested in a long-term, monogamous relationship. In terms of ethnicity, the user is open to dating white Caucasians, Native Americans, Asians, or Black African descents. Politically, liberal leaning men are preferred. Her ideal partner's occupation should be within the healthcare, education, or art industries. He should also value family and work-life balance, and be supportive. She would like him to have interests in travel, healthy eating, and art. Lastly, he should have at least an undergraduate or graduate level of education, and be able to speak English.",
    "user_id": "5729d3c1-d8ff-42d4-a12f-d776833ded7e"
}
