{
    "name": "Jasper McFlynn",
    "age": 32,
    "height": "5'11\"",
    "school": "University of British Columbia",
    "job_industry": "Engineering",
    "job_title": "Civil Engineer",
    "hometown_location": "Vancouver, British Columbia",
    "dating_location": "Los Angeles, California",
    "languages_spoken": [
        "English",
        "French"
    ],
    "values": [
        "Hard work",
        "Creativity",
        "Kindness"
    ],
    "interests": [
        "Hiking",
        "Playing guitar",
        "Reading"
    ],
    "education_level": "Graduate",
    "religious_beliefs": "Agnostic",
    "politics": "Liberal",
    "dating_intentions": "Long term",
    "relationship_type": "Monogamy",
    "gender": "Man",
    "pronouns": "He/Him/His",
    "sexuality": "Straight",
    "ethnicity": "White Caucasian",
    "has_children": false,
    "want_children": true,
    "pets": [
        "Dog"
    ],
    "zodiac_sign": "Taurus",
    "mbti_personality_type": "ISTJ",
    "drinking": "Yes",
    "smoking": "No",
    "marijuana": "No",
    "drugs": "No",
    "exercise": "Active",
    "partner_preferences": {
        "minimum_age": 26,
        "maximum_age": 36,
        "minimum_height": "5'0\"",
        "maximum_height": "6'0\"",
        "has_children": false,
        "want_children": true,
        "sexuality": "Straight",
        "drinking": "Sometimes",
        "smoking": "No",
        "marijuana": "No",
        "drugs": "No",
        "exercise": "Sometimes",
        "gender": "Woman",
        "dating_intentions": "Long term",
        "relationship_type": "Monogamy",
        "ethnicities": [
            "Black African Descent",
            "East Asian",
            "Hispanic/Latino",
            "Middle Eastern",
            "Native American",
            "Pacific Islander",
            "South Asian",
            "Southeast Asian",
            "White Caucasian"
        ],
        "politics": [
            "Liberal",
            "Moderate"
        ],
        "job_industry": [
            "All"
        ],
        "languages_spoken": [
            "English"
        ],
        "values": [
            "Kindness",
            "Creativity",
            "Hard work"
        ],
        "interests": [
            "Outdoor activities",
            "Music",
            "Reading"
        ],
        "education_level": [
            "Undergraduate",
            "Graduate"
        ]
    },
    "profile_summary": "The profile is of a 32 year old man, 5'11\" in height with Taurus as his zodiac sign and \"ISTJ\" as his MBTI personality type . He is a Civil Engineer by profession and is in the engineering industry. He considers himself a straight man practicing monogamy, aiming at a long term relationship. Extra emphasis is placed on creativity, kindness, and hard work in his determinations of personal success. Born and raised in Vancouver, British Columbia, this proud alum of the University of British Columbia, now resides in Los Angeles, California working steadfastly towards his goals. He speaks English and French fluently, falls into the category of agnostics, exercises actively and take a liberal stance on politics. This adventurous-bent individual's love for hiking intercepts brilliantly with his dense love for literature and natural knack for playing the guitar. While he is a dog lover, he does not have children, but he definitely wishes to have them in the future. Graduation at the top level is his highest quest in educational accomplishment so far. Living his life carefree, he rules against smoking inversely conceding to millennials trend of having a yes to alcohol. All drug, including marijuana, is a total no for him.",
    "preferences_summary": "The user is seeking a woman aged between 26 to 36, and within a height range of 5'0\" to 6'0\". She should not have children but would like to have them in the future, avoiding smoking and drug use, enjoys occasional drinking, and engages in exercising sometimes. Interested in long-term dating and monogamy, she would ideally be straight. The desirable woman could belong to a myriad of ethnic backgrounds creating room for Black African Descent, East Asian, Hispanic/Latino, Middle Eastern, Native American, Pacific Islander, South Asian, Southeast Asian, or White Caucasian. Whether liberal or moderate in political stance, her job industry is unrestricted although knowledge of English is vital. Her values should mirror his own: kindness, creativity, and hard work and share interests in outdoor activities, music, and reading. As for education, the preference leans towards partners with an undergraduate or graduate education.",
    "user_id": "a814062d-8581-4763-980f-f249c67510f9"
}
